
# ! exercise 4

print(23 + 2)
print(10 - 5)
print(15 * 12)
print(77 / 7)

# ! exercise 5-8

birth_year = 2007 # <> ჩემი დაბადების წელი
present =  2024 
print("Hi my name is Nika i am " + str(present - birth_year) + " years old")
# <> ეს კოდი მოიცავს მეხუთე და მერვე დავალებებს.
# <> ორი ტექსტური მონაცემის შეერთებას და 
# <> 2 შენახულ ცვლადს შორის არითმეტიკული მოქმედების ჩატარებას 

# ! exercise 7, 9 

# ? ტერმინალი არის ადგილი სადაც ჩვენს მიერ დაწერილი კოდის შედეგი იბეჭდება
# ? ტერმინალი გვეხმარება შეცდომების ნახვაში,
# ? მაგრამ ამას გარდა ტერმინალში შეგვიძლია სხვადახვა აპლიკაციების კონტროლი

# / სტრინგი არის ტექსტური ტიპის მონაცემი ამ ტიპის მონაცემებში 
# / შედის: წინადადება, სიტყვა, ასობგერა, სახელი და ასშ.
# / print("") ფუნქციის დახმარებით იგი გამოგვაქვს ტერმინალში 

# / მთელი რიცხვი (integer) არის რიცხვის ტიპის მონაცემი მაგ: 0, 1, 2,
# / 3, 4, 5... integer-ში არ შედის float იგივე ათწილადი რიცხვები მაგ: 1,2