function findOdd(A) {
    //// ობიექტი რომელიც ინახავს რიცხვის გამეორების რაოდენობას 
    let frequency = {};

    /// გადავუყვეთ შემოტანილ მასივს და დავთვალოთ გამეორების რაოდენობა
    for (let i = 0; i < A.length; i++) {
        let num = A[i]; /// მიმდინარე რიცხვი მასივიდან
        //<> თუ რიცხვი არ არის ობიექტში მაშინ მას მივანიჭებთ მნიშვნელობა 1-ს
        
        if (frequency[num] === undefined) {
            frequency[num] = 1;
        } else {
            //// თუ რიცხვი უკვე არის ობიექტში მაშინ მის რაოდენობას გავზრდით ერთით
            //// (იმდენჯერ რამდენჯერაც ეს რიცხვი იქნება ობიექტში)
            frequency[num]++;
        }
    }
    //\ გადავუყვებით frequency-ის რომ ვნახოთ რიცხვი კენტი რაოდენობის გამეორებით
    
    for (let num in frequency) {
        if (frequency[num] % 2 !== 0) {
            return Number(num);  //| გადავიყვანოთ სტრინგი რიცხვად
        }
    }
}
