//<> smallest Integer (Missing Number)
function missingNumber(matrix) {
  let found = []; /// მასივი რიცხვებისთვის რომლებსაც ვიპოვით

  //// გადავუყვეთ რიცხვებს 0-დან 100-მდე
  for (let i = 0; i < 101; i++) {
    found[i] = false; ///  გავუტოლოთ ყველა false-ს
  }

  /// გადავუყვეთ მატრიცას და რიცხვები მოვნიშნოთ true-თი
  for (let i = 0; i < matrix.length; i++) {
    for (let j = 0; j < matrix[i].length; j++) {
      let num = matrix[i][j]; //// ახლანდელი რიცხვი
      if (num >= 0 && num < 101) {
        //<> დავრწმუნდეთ რომ რიცხვი 0დან 101 მდეა
        found[num] = true; //// მოვნიშნოთ ნაპოვნად
      }
    }
  }

  //// ვიპოვოთ ყველაზე პატარა რიცხვი რომელიც არ გვიპოვია
  let i = 0; //// დავიწყოთ 0-დან
  while (i < 101) {
    /// გადავუყვეთ ნაპოვნების მასივს
    if (!found[i]) {
      //// თუ რიცხვი არ იყო ნაპოვნების მასივში დავაბრუნოთ იგი
      return i;
    }
    i++; //// გავაგრძელოთ
  }
}
